names = ['Путин', 'Шувалов', 'Медведев', 'Дарвин', 'Путина',
         'Шувалова', 'Медведева',  'Касперский', 'Навальный', 'Толстой',
         'Касперская', 'Навальная', 'Толстая', 'Обама', 'Ваенга', 'Бульба','Дюма',
         'Данелия', 'Берия', 'Гайдай', 'Кукуй', 'Врубель', 'Дудь',
         'Трамп', 'Яценюк', 'Кац', 'Джексон', 'Левитан']
names_new=[]
for name in names:
    if (name[-2:] == 'ая' or name[-2:] == 'ий' or name[-2:] == 'ой' \
            or name[-2:] == 'ый' or name[-2:] == 'ая') and len(name) > 5:
        namesearch = name[:-2]
    elif name[-1:] == 'а' or name[-1:] == 'ь' or name[-1:] == 'й' and len(name):
        namesearch = name[:-1]
    else:
        namesearch = name
    names_new.append(namesearch)
print(names_new)
#['Путин', 'Шувалов', 'Медведев', 'Дарвин', 'Путин', 'Шувалов', 'Медведев',
# 'Касперск', 'Навальн', 'Толст', 'Касперск', 'Навальн', 'Толст', 'Обам',
# 'Ваенг', 'Бульб', 'Дюм','Данелия', 'Берия', 'Гайда', 'Куку', 'Врубел',
# 'Дуд', 'Трамп', 'Яценюк', 'Кац', 'Джексон', 'Левитан']